In [1]:
import pandas as pd

In [30]:
salaries = pd.DataFrame({'City':['Paris','Warsaw','Berlin','Dublin','London'],
                         'Avg Salary':[58000, 45000, 55000, 60000, 62000]})
salaries.set_index("City",inplace=True)
salaries

        Avg Salary
City
Paris        58000
Warsaw       45000
Berlin       55000
Dublin       60000
London       62000

In [31]:
staff = pd.DataFrame({'Staff':['Mary','John','Jack','Sally','Mark','Jane'],
                         'City':['Dublin','Berlin','Warsaw','Paris','Dublin','Lisbon']})
staff.set_index("City",inplace=True)
staff

        Staff
City
Dublin   Mary
Berlin   John
Warsaw   Jack
Paris   Sally
Dublin   Mark
Lisbon   Jane

In [4]:
#we want staff, city, salary as columns#

In [6]:
# so might look like
# Mary, Dublin, 6000
# John, Berlin, 55000
# Jane, Lisbon, NA - note that no salary for Lisbon
# NA, London, 62000 - note no name for London
# 7 rows, 3 columns ideal option 
# concate, join, merge are the options to use for joining data

In [7]:
CAvideos=pd.read_csv("CAvideos.csv")
DEvideos=pd.read_csv("DEvideos.csv")

In [8]:
CAvideos.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 40881 entries, 0 to 40880
Data columns (total 16 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   video_id                40881 non-null  object
 1   trending_date           40881 non-null  object
 2   title                   40881 non-null  object
 3   channel_title           40881 non-null  object
 4   category_id             40881 non-null  int64
 5   publish_time            40881 non-null  object
 6   tags                    40881 non-null  object
 7   views                   40881 non-null  int64
 8   likes                   40881 non-null  int64
 9   dislikes                40881 non-null  int64
 10  comment_count           40881 non-null  int64
 11  thumbnail_link          40881 non-null  object
 12  comments_disabled       40881 non-null  bool
 13  ratings_disabled        40881 non-null  bool
 14  video_error_or_removed  40881 non-null  bool
 15  description             39585 non-null  object
dtypes: bool(3), int64(5), object(8)
memory usage: 4.2+ MB

In [9]:
DEvideos.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 40840 entries, 0 to 40839
Data columns (total 16 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   video_id                40840 non-null  object
 1   trending_date           40840 non-null  object
 2   title                   40840 non-null  object
 3   channel_title           40840 non-null  object
 4   category_id             40840 non-null  int64
 5   publish_time            40840 non-null  object
 6   tags                    40840 non-null  object
 7   views                   40840 non-null  int64
 8   likes                   40840 non-null  int64
 9   dislikes                40840 non-null  int64
 10  comment_count           40840 non-null  int64
 11  thumbnail_link          40840 non-null  object
 12  comments_disabled       40840 non-null  bool
 13  ratings_disabled        40840 non-null  bool
 14  video_error_or_removed  40840 non-null  bool
 15  description             39288 non-null  object
dtypes: bool(3), int64(5), object(8)
memory usage: 4.2+ MB

In [10]:
concat_data=pd.concat([CAvideos,DEvideos])
concat_data.info()

NameError: name 'concat' is not defined

In [11]:
concat_data=pd.concat([CAvideos,DEvideos])
concat_data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 81721 entries, 0 to 40839
Data columns (total 16 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   video_id                81721 non-null  object
 1   trending_date           81721 non-null  object
 2   title                   81721 non-null  object
 3   channel_title           81721 non-null  object
 4   category_id             81721 non-null  int64
 5   publish_time            81721 non-null  object
 6   tags                    81721 non-null  object
 7   views                   81721 non-null  int64
 8   likes                   81721 non-null  int64
 9   dislikes                81721 non-null  int64
 10  comment_count           81721 non-null  int64
 11  thumbnail_link          81721 non-null  object
 12  comments_disabled       81721 non-null  bool
 13  ratings_disabled        81721 non-null  bool
 14  video_error_or_removed  81721 non-null  bool
 15  description             78873 non-null  object
dtypes: bool(3), int64(5), object(8)
memory usage: 9.0+ MB

In [12]:
#note that above has 81k entries as opposed to separate DE and CA which were 40k mark each

In [13]:
#going back to our salary and city example

In [19]:
pd.concat([staff,salaries],axis=1)

   Staff    City    City  Avg Salary
0   Mary  Dublin   Paris     58000.0
1   John  Berlin  Warsaw     45000.0
2   Jack  Warsaw  Berlin     55000.0
3  Sally   Paris  Dublin     60000.0
4   Mark  Dublin  London     62000.0
5   Jane  Lisbon     NaN         NaN

In [ ]:
#noticed an issue with list names - one qwas City the other was CIties - amended

In [18]:
pd.concat([staff,salaries]axis=1)

SyntaxError: invalid syntax (3623695329.py, line 1)

In [20]:
pd.concat([staff,salaries],axis=1)

   Staff    City    City  Avg Salary
0   Mary  Dublin   Paris     58000.0
1   John  Berlin  Warsaw     45000.0
2   Jack  Warsaw  Berlin     55000.0
3  Sally   Paris  Dublin     60000.0
4   Mark  Dublin  London     62000.0
5   Jane  Lisbon     NaN         NaN

In [21]:
#the concat uses straight forward row by row merge - see city lines etc above

In [ ]:
#we will attempt to use a JOIN instead - see below code

In [22]:
staff.join([salaries])

ValueError: Indexes have overlapping values: Index(['City'], dtype='object')

In [23]:
#asked to specify a suffix otherwise it will not execute

In [24]:
staff.join(salaries,lsuffix="_staff",rsuffix="_salaries")

   Staff City_staff City_salaries  Avg Salary
0   Mary     Dublin         Paris     58000.0
1   John     Berlin        Warsaw     45000.0
2   Jack     Warsaw        Berlin     55000.0
3  Sally      Paris        Dublin     60000.0
4   Mark     Dublin        London     62000.0
5   Jane     Lisbon           NaN         NaN

In [25]:
#ISSUE - exact same output as CONCAT - only improvement is there no duplicate column headers see CIty_staff and City_salaries

In [26]:
# DataFrame.join(other, on=None, how='left', lsuffix='', rsuffix='', sort=False)[source]

In [ ]:
# class pandas.DataFrame(data=None, index=None, columns=None, dtype=None, copy=None)[sou

In [32]:
staff.join(salaries,lsuffix="_staff",rsuffix="_salaries")

        Staff  Avg Salary
City
Berlin   John     55000.0
Dublin   Mary     60000.0
Dublin   Mark     60000.0
Lisbon   Jane         NaN
Paris   Sally     58000.0
Warsaw   Jack     45000.0

In [33]:
# JOINS will work if your Index are the same as we amended code in salaries and staff at beginning of code file

In [ ]:
# you no longer need the lsuffix and rsuffix

In [34]:
staff.join(salaries)

        Staff  Avg Salary
City
Berlin   John     55000.0
Dublin   Mary     60000.0
Dublin   Mark     60000.0
Lisbon   Jane         NaN
Paris   Sally     58000.0
Warsaw   Jack     45000.0

In [35]:
staff("city")

TypeError: 'DataFrame' object is not callable

In [36]:
staff.index

Index(['Dublin', 'Berlin', 'Warsaw', 'Paris', 'Dublin', 'Lisbon'], dtype='object', name='City')

In [38]:
# unable to call data by simply using staff ["city"] and we do not want to have to use staff.reset_index() so we will remove the indexing code we used

In [58]:
salaries = pd.DataFrame({'City':['Paris','Warsaw','Berlin','Dublin','London'],
                         'Avg Salary':[58000, 45000, 55000, 60000, 62000]})
salaries

     City  Avg Salary
0   Paris       58000
1  Warsaw       45000
2  Berlin       55000
3  Dublin       60000
4  London       62000

In [56]:
staff = pd.DataFrame({'Staff':['Mary','John','Jack','Sally','Mark','Jane'],
                         'City':['Dublin','Berlin','Warsaw','Paris','Dublin','Lisbon']})
staff

   Staff    City
0   Mary  Dublin
1   John  Berlin
2   Jack  Warsaw
3  Sally   Paris
4   Mark  Dublin
5   Jane  Lisbon

In [41]:
pd.merge(staff,salaries)

   Staff    City  Avg Salary
0   Mary  Dublin       60000
1   Mark  Dublin       60000
2   John  Berlin       55000
3   Jack  Warsaw       45000
4  Sally   Paris       58000

In [42]:
# discounts London and Lisbon

In [43]:
pd.merge(staff,salaries,how="inner")

   Staff    City  Avg Salary
0   Mary  Dublin       60000
1   Mark  Dublin       60000
2   John  Berlin       55000
3   Jack  Warsaw       45000
4  Sally   Paris       58000

In [44]:
pd.merge(staff,salaries,how="left")

   Staff    City  Avg Salary
0   Mary  Dublin     60000.0
1   John  Berlin     55000.0
2   Jack  Warsaw     45000.0
3  Sally   Paris     58000.0
4   Mark  Dublin     60000.0
5   Jane  Lisbon         NaN

In [45]:
#note that Lisbon has no salary as in salaries table it has nothing - but we know Jane is in Lisbon from the staff table

In [46]:
# staff = DF1 (LEFT) and salaries = DF2 (RIGHT)

In [47]:
pd.merge(staff,salaries,how="right")

   Staff    City  Avg Salary
0  Sally   Paris       58000
1   Jack  Warsaw       45000
2   John  Berlin       55000
3   Mary  Dublin       60000
4   Mark  Dublin       60000
5    NaN  London       62000

In [48]:
# Lisbon disappears as left table not priortised - London is in as RIght table prioritised. TO get all use OUTER

In [49]:
pd.merge(staff,salaries,how="outer")

   Staff    City  Avg Salary
0   Mary  Dublin     60000.0
1   Mark  Dublin     60000.0
2   John  Berlin     55000.0
3   Jack  Warsaw     45000.0
4  Sally   Paris     58000.0
5   Jane  Lisbon         NaN
6    NaN  London     62000.0

In [51]:
# ideal format has been gathered - MERGE was ideal solution. Let's change tables data for staff/salaries to City/Cities

In [53]:
pd.merge(staff,salaries,how="outer")

MergeError: No common columns to perform merge on. Merge options: left_on=None, right_on=None, left_index=False, right_index=False

In [54]:
pd.merge(staff,salaries,how="outer",left_on="City",right_on="Cities")

KeyError: 'Cities'

In [57]:
pd.merge(staff,salaries,how="outer",left_on="City",right_on="Cities")

   Staff    City  Cities  Avg Salary
0   Mary  Dublin  Dublin     60000.0
1   Mark  Dublin  Dublin     60000.0
2   John  Berlin  Berlin     55000.0
3   Jack  Warsaw  Warsaw     45000.0
4  Sally   Paris   Paris     58000.0
5   Jane  Lisbon     NaN         NaN
6    NaN     NaN  London     62000.0

In [59]:
pd.merge(staff,salaries,how="outer")

   Staff    City  Avg Salary
0   Mary  Dublin     60000.0
1   Mark  Dublin     60000.0
2   John  Berlin     55000.0
3   Jack  Warsaw     45000.0
4  Sally   Paris     58000.0
5   Jane  Lisbon         NaN
6    NaN  London     62000.0